[
  {
    "title": "Brash for It",
    "author": "Chelsea Camaron",
    "description": "In scars lie stories. Our story is beauty in the broken in this passion-fueled ride … are you ready? Kellum 'Pretty Boy' Oleander, raised under the safety of the Hellions, is the wild card with a scarred face and a reputation to match. Kristen Hope Mayers, once living a jet-setting life, finds herself broken and changed. Their chance encounter leads to an intense, passionate journey as two broken souls collide. This novel is currently the #1 best-selling romantic suspense on Apple Books and is trending on BookTok for its intense chemistry and emotional depth.",
    "publication_date": "2025-07-16",
    "tropes": [
      "Beauty and the Beast",
      "Broken hero/heroine",
      "Found family",
      "Second chance",
      "Opposites attract",
      "Healing together"
    ],
    "category": [
      "Romantic Suspense",
      "Contemporary Romance",
      "Motorcycle Club Romance"
    ]
  },
  {
    "title": "Forever Country",
    "author": "Kathleen Brooks",
    "description": "Holt Everett, a country music superstar, finds his life upended when Annaleigh Astore, an entertainment agent receiving threats, seeks his help. As their relationship heats up, so do the dangers, leading to a suspenseful and romantic journey. This book is popular for its blend of celebrity romance and suspenseful plot twists, and is frequently recommended on romance forums and TikTok.",
    "publication_date": "2025-06-25",
    "tropes": [
      "Celebrity romance",
      "Protective hero",
      "Fish out of water",
      "Forced proximity",
      "Damsel in distress",
      "Danger brings them together"
    ],
    "category": [
      "Romantic Suspense",
      "Contemporary Romance",
      "Celebrity Romance"
    ]
  },
  {
    "title": "Forever Remembered",
    "author": "Kathleen Brooks",
    "description": "Knox Everett, a professional quarterback, reconnects with his college crush, Quinn Kennedy, who is now embroiled in a dangerous situation involving illegal gambling. Knox is determined to protect her, risking his career and their chance at love. This title is trending for its second-chance romance and high-stakes suspense.",
    "publication_date": "2025-03-26",
    "tropes": [
      "Second chance romance",
      "Reconnected lovers",
      "Sports romance",
      "Protective hero",
      "Dangerous secrets",
      "Small town"
    ],
    "category": [
      "Romantic Suspense",
      "Contemporary Romance",
      "Sports Romance"
    ]
  },
  {
    "title": "Full Tilt",
    "author": "Janet Evanovich & Charlotte Hughes",
    "description": "Jamie Swift, a small-town newspaper owner, finds her life turned upside down by her mysterious partner, Maximillian Holt. Together, they navigate political intrigue, crime, and a budding romance in a story filled with danger and humor. This classic romantic suspense has seen a fresh wave of popularity due to social media recommendations.",
    "publication_date": "2025-04-02",
    "tropes": [
      "Opposites attract",
      "Partners in crime (solving)",
      "Small town",
      "Reluctant allies",
      "Slow burn romance",
      "Witty banter"
    ],
    "category": [
      "Romantic Suspense",
      "Mystery Romance",
      "Humorous Romance"
    ]
  },
  {
    "title": "With You and Me and Us",
    "author": "Sarah A. Bailey",
    "description": "A standalone romantic suspense novel blending emotional depth with gripping tension. The story follows two protagonists whose lives intertwine amidst secrets and danger, set against a backdrop of small-town intrigue. Frequently recommended on BookTok for its blend of heartfelt romance and suspenseful plot twists, with readers praising its character development and slow-burn romance.",
    "publication_date": "2025-02-11",
    "tropes": [
      "Slow burn",
      "Small town mystery",
      "Found family",
      "Emotional healing",
      "Hidden secrets",
      "Enemies to lovers"
    ],
    "category": [
      "Romantic Suspense",
      "Contemporary Romance",
      "Standalone Romance"
    ]
  },
  {
    "title": "Hide and Seek",
    "author": "Victoria Wilder",
    "description": "This novel features a high-stakes game of cat and mouse, where the main characters must confront their pasts while navigating a dangerous present. The romance is tightly woven with the suspense, making it a favorite among fans of the genre. BookTok and Instagram users highlight its fast-paced narrative and the chemistry between the leads.",
    "publication_date": "2025-01-22",
    "tropes": [
      "Cat and mouse",
      "Enemies to lovers",
      "Past trauma",
      "Forced proximity",
      "On the run",
      "Redemption"
    ],
    "category": [
      "Romantic Suspense",
      "Thriller Romance"
    ]
  },
  {
    "title": "Her Soul to Take: A Paranormal Dark Academia Romance",
    "author": "Author not specified",
    "description": "While primarily a paranormal romance, this book incorporates strong suspense elements, with a dark academia setting and a plot involving secrets, danger, and forbidden love. The book is a frequent mention in BookTok’s dark romance and romantic suspense circles, especially for readers who enjoy a supernatural twist to their suspense.",
    "publication_date": "2025-05-13",
    "tropes": [
      "Dark academia",
      "Forbidden love",
      "Paranormal romance",
      "Secret societies",
      "Enemies to lovers",
      "Haunted locations"
    ],
    "category": [
      "Romantic Suspense",
      "Paranormal Romance",
      "Dark Romance"
    ]
  },
  {
    "title": "Nocticadia",
    "author": "Author not specified",
    "description": "A blend of romantic suspense and fantasy, 'Nocticadia' features a mysterious world, a brooding love interest, and a protagonist caught in a web of secrets and danger. Its unique mix of genres and atmospheric storytelling have made it a BookTok favorite, with many users recommending it for fans of both romance and suspense.",
    "publication_date": "2025-03-18",
    "tropes": [
      "Brooding hero",
      "Secret identity",
      "Fantasy world",
      "Star-crossed lovers",
      "Mystery",
      "Hidden pasts"
    ],
    "category": [
      "Romantic Suspense",
      "Fantasy Romance",
      "Dark Fantasy"
    ]
  },
  {
    "title": "Onyx Storm",
    "author": "Rebecca Yarros",
    "description": "A romantasy featuring anti-hero themes, magical intrigue, and high emotional stakes. This title has gained significant traction on BookTok for its blend of romance and fantasy world-building, and is frequently featured in TikTok 'must-read' lists and Instagram reels.",
    "publication_date": "2025-08-12",
    "tropes": [
      "Anti-hero",
      "Enemies to lovers",
      "Magic school",
      "High stakes",
      "Forbidden magic",
      "Slow burn"
    ],
    "category": [
      "Romantic Suspense",
      "Fantasy Romance",
      "Romantasy"
    ]
  },
  {
    "title": "Bride",
    "author": "Ali Hazelwood",
    "description": "A paranormal romance that has gone viral for its unique take on supernatural romance, blending Hazelwood’s signature wit with dark, magical elements. One of the most talked-about books on BookTok, with thousands of user-generated reviews and themed content.",
    "publication_date": "2025-02-04",
    "tropes": [
      "Arranged marriage",
      "Paranormal romance",
      "Enemies to lovers",
      "Supernatural creatures",
      "Witty banter",
      "Fated mates"
    ],
    "category": [
      "Paranormal Romance",
      "Romantic Suspense",
      "Dark Romance"
    ]
  }
]